Revit 2027 API
RoutingPreferenceErrorLevel Enumeration
 An enumerated type listing the options for posting errors or warnings when routing preferences are not satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RoutingPreferenceErrorLevel
Public Enumeration RoutingPreferenceErrorLevel
public enum class RoutingPreferenceErrorLevel
type RoutingPreferenceErrorLevel
Members
Member name | Value | Description
Error | 2 |  Post Revit errors if there is no rule in the routing preference satisfying the current condition.
None | 0 |  Do not post any warning or error if there is no rule in the routing preference satisfying the current condition.
Warning | 1 |  Post Revit warnings if there is no rule in the routing preference satisfying the current condition.
See Also
Reference
Autodesk.Revit.DB Namespace